SET NAMES UTF8;
DROP DATABASE IF EXISTS xuanfeng;
CREATE DATABASE xuanfeng CHARSET=UTF8;
USE xuanfeng;
CREATE TABLE xf_user(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(32),
  upwd VARCHAR(32),
  unumber VARCHAR(32),
  upic VARCHAR(100)
);
CREATE TABLE xf_product(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  pname VARCHAR(64),
  pic VARCHAR(100),
  pupdate INT,
  pwriter VARCHAR(32),
  ptype_1 VARCHAR(2),
  ptype_2 VARCHAR(2),
  ptype_3 VARCHAR(2),
  phot VARCHAR(10),
  pinfo VARCHAR(100)
);
INSERT INTO xf_product VALUES
(null,'逃亡','images/all_list/ret-search-item_01.jpg',7,'漫疯子','热血','冒险','格斗','96.8万','充满废墟的世界秩序刚刚开始建立。天眼组织掌握了一种神秘的技术使其快速崛起强大。就在这时候天眼组织中逃...'),
(null,'皇太子，请收留','images/all_list/ret-search-item_02.jpg',29,'i尚漫 图：七渺渔 文：七渺渔','魔幻','穿越','恋爱','823.9万','什么？穿越！穿越到一只猫身上！还要被追杀？我怎么这么惨！车祸穿越的悲惨故事，似乎在撞上皇太子后开始转...'),
(null,'今天开始做女神','images/all_list/ret-search-item_03.jpg',195,'隔壁的特特罗','都市','搞笑','魔幻','5.2万','一枚老实巴交的大二男生，竟被人活生生变做了36D的金发美女？到底是谁下的毒手？还会有更倒霉的事情在等...'),
(null,'快意十三刀','images/all_list/ret-search-item_04.jpg',24,'月饼 图：月饼 文：月饼','搞笑','冒险','武侠','737万','大型架空古装武侠连续剧《快意十三刀》讲述的是一名少年立志成为 大☆巨☆侠 并为此付出泪水、汗水与智商...'),
(null,'王牌狗仔','images/all_list/ret-search-item_05.jpg',11,'多多漫画工作室 图：多多 文：甜甜酱','悬疑','都市','励志','658.1万','美女狗仔和相机之神带你看遍娱乐这个圈～～大一女生无意中买的古董相机居然是半个世纪以前的意大利狗仔之父...'),
(null,'召唤天下','images/all_list/ret-search-item_06.jpg',109,'周智延 图：周智延 文：钢屌','热血','冒险','恐怖','6.8万','【这是一部和英雄合体的漫画】传闻自古就有可以召唤英魂之人，他们借助英魂的力量，可以做出许多惊天动地的...'),
(null,'无罪之城','images/all_list/ret-search-item_07.jpg',113,'宇宙牧场 图：宇宙牧场&小甘鱼 文：钻咖','热血','冒险','科幻','10.6万','精英特种兵唐柯被指派了一项新任务，他要只身前往一栋住满了重罪犯的大楼，还要靠自己把这些罪犯全部“劝”...'),
(null,'野有蔓草','images/all_list/ret-search-item_08.jpg',28,'徐嘘嘘','冒险','玄幻','恋爱','303.6万','在这样的世界里，不论是飞禽走兽还是花鸟蛇虫都拥有着半人半兽的身体。为了生存他们隐藏在市井之中，有一些...'),
(null,'尘灯宝谭','images/all_list/ret-search-item_09.jpg',131,'鲜漫动漫 图：惊面兔 文：惊面兔','恐怖','悬疑','都市','3.8万','世间的事物，受到特殊风水，或是人类情感的影响，就有可能发生变异，产生宝气，并对周围产生特殊的影响。打...'),
(null,'红雾','images/all_list/ret-search-item_10.jpg',206,'A4漫业滴水工坊 图：台风 文：台风','恐怖','惊险','推理','5.6万','吴鑫是个普通的大学生。在寝室里打着LOL的他碰上被僵尸群追赶的本系女神水玲和富二代白得富。原本平静的...'),
(null,'老师是无赖','images/all_list/ret-search-item_11.jpg',173,'周智延 图：鼠叔 文：木子呆','校园','恐怖','玄幻','6.9万','具有一定灵力的通灵教师，第38代陆氏驱魔师，在一所阴气很重的高中智兰高中任教，真实目的是因为这高中有...'),
(null,'白泽异闻录','images/all_list/ret-search-item_12.jpg',127,'三神工作室','搞笑','玄幻','恋爱','8.6万','眼镜痴女灵芸发现了懦弱帅哥白泽霸气侧漏的一面，从而每天过着心惊胆战又福利满满的捕妖日常。周三周日双更...'),
(null,'奇贱联萌','images/all_list/ret-search-item_13.jpg',4,'春叔','搞笑','萌系','都市','802','不装B，怎么上头版！不晒命，怎么赢人气！'),
(null,'宛香','images/all_list/ret-search-item_14.jpg',99,'云端漫画 图：金爷 文：佟佳东珠','恋爱','虐心','唯美','1.1亿','她是满洲贵族佟佳氏之后，媒介之约嫁给了贫民出身的督军，却不想对方早已心有所属，她成为了丈夫爱情里的第...'),
(null,'极品修真少年','images/all_list/ret-search-item_15.jpg',103,'漫考拉 图：漫考拉 文：雷语','热血','玄幻','都市','6.7亿','九州大陆最强的修仙少年，却因体内的禁忌力量成为家族的耻辱而被强行行刑，在母亲的救赎下意外穿越到了盖亚...'),
(null,'斗罗大陆外传神','images/all_list/ret-search-item_16.jpg',136,'神漫 图：《绝世唐门》漫画创作组','热血','冒险','励志','2.2亿','因为善良之神与邪恶之神转世、更迭，神界内部矛盾逐渐升级，以毁灭之神为首的一众神祇向以海神、修罗神为首...'),
(null,'侍灵演武','images/all_list/ret-search-item_17.jpg',134,'i尚漫 图：白猫 文：左小权','热血','魔幻','历史','1983.3万','真人版三国杀？周瑜竟然…是女儿身？！！废柴男主开启金手指路线，傲娇妹子充当打手，火辣美女作家一再挑逗...'),
(null,'喏喏族','images/all_list/ret-search-item_18.jpg',347,'诺动漫工作室','搞笑','都市','生活','33.3万','喏喏族（NONO族），就是唯唯诺诺的屌丝一族！他们生活在城市里，工作在写字楼中，让人艳羡！实际上，他...'),
(null,'寻师伏魔录','images/all_list/ret-search-item_19.jpg',18,'深圳伍壹捌动漫有限公司','冒险','魔幻','悬疑','235.7万','五行山下，历经九世轮回的玄奘法师，冥冥中与因厌世隐匿山中的大猴子悟空再次相遇，法师聆听悟空讲述他历经...'),
(null,'火柴人大世界','images/all_list/ret-search-item_20.jpg',3,'眼镜蛇 图：zrc 文：zrc','科幻','战争','格斗','3730','火柴人大世界，擦头就练法轮功~~~~'),
(null,'傲娇猫','images/all_list/ret-search-item_21.jpg',4,'小游嘟嘟 图：小游嘟嘟 文：小游嘟嘟','搞笑','萌系','治愈','2.1万','一句话的简介：关于一只长着呆毛很傲娇的猫和一个同样长着呆毛但是很萌二的主人在一起一边争论关于谁是主人...'),
(null,'没意义的小故事','images/all_list/ret-search-item_22.jpg',14,'沄顶端 图：云顶端 文：云顶端','搞笑','萌系','恶搞','1.4万','无聊的小故事，每日一更。'),
(null,'界','images/all_list/ret-search-item_23.jpg',3,'夏寒 图：夏寒 文：夏寒','热血','搞笑','格斗','1184','我生活的世界也许和你的世界不太一样。这里存在妖怪，恶魔，甚至是无限接近神的存在，一切的相遇都是命运的...'),
(null,'一拳就倒','images/all_list/ret-search-item_24.jpg',65,'8号','热血','冒险','搞笑','4.2万','主角二毛一个普普通通的高中生，理想是成为一名超级英雄，由于母亲被坏人劫持，被迫去参加英雄大会的二毛结...'),
(null,'双面名媛','images/all_list/ret-search-item_25.jpg',15,'左岸卡漫','都市','恋爱','虐心','2187.2万','人见人爱的聪明女白领本来有个稳定的男朋友，谁知就在庆祝升职的当晚……什么？竟然有个和我长得一模一样的...'),
(null,'大师别走啊','images/all_list/ret-search-item_26.jpg',2,'插画师夏语荷 图：插画师夏语荷','搞笑','恶搞','爆笑','5','《大师别走啊》讲述了三月半和笑天两人之间的一些不得不说的故事。连载中，据说关注了我们的粉丝新的一年都...'),
(null,'张小盒出差记','images/all_list/ret-search-item_27.jpg',1,'张小盒','搞笑','恋爱','都市','8402','没出差时盼望着出差，出差时渴望不出差，矛盾是天生的。'),
(null,'J叔说星座','images/all_list/ret-search-item_28.jpg',12,'J叔','搞笑','恋爱','恶搞','5123','J叔星座，来自逗逼老司机的星座预测，个性化的星座分析从此开始！微信公众号：jshu666'),
(null,'很纯很暧昧','images/all_list/ret-search-item_29.jpg',23,'三福动漫 图：DAZUI 文：鱼人二代','校园','后宫','恋爱','2.5亿','杨明是一名普通的高中生，打架斗殴逃课作弊，标准的差生一个。暗恋着校花不敢表白，参加高考也没有希望。可...'),
(null,'一只高跟鞋','images/all_list/ret-search-item_30.jpg',11,'Haotoon 图：赵星璜 文：赵星璜','热血','励志','格斗','5.1万','姜志侯受到路易威登总公司的委托准备举办一场世界名牌时装秀，而去寻找适合的主秀模特，一个偶然的机会，在...'),
(null,'斗罗大陆Ⅱ绝世精品','images/all_list/ret-search-item_31.jpg',239,'神漫 图：《绝世唐门》漫画创作组','热血','冒险','励志','1.9亿','这里没有魔法，没有斗气，没有武术，却有武魂。唐门创立万年之后的斗罗大陆上，唐门式微。一代天骄横空出世...'),
(null,'细思极恐故事会','images/all_list/ret-search-item_32.jpg',58,'Echoesnet','恐怖','悬疑','推理','671.6万','细思极恐的小故事，胆小慎入，结尾有解析指南。微信公众号：kanlian666'),
(null,'TEMPO','images/all_list/ret-search-item_33.jpg',14,'卧底理财师 图：卧底理财师 文','冒险','科幻','悬疑','4498','一个悬疑科幻故事，微博首发，微博：卧底理财师，欢迎吐槽'),
(null,'三国花木兰','images/all_list/ret-search-item_34.jpg',24,'企鹅跳 图：企鹅跳 文：企鹅跳','搞笑','冒险','战争','24.9万','花木兰出生那年，外戚专权，宦官秉政，政治腐败，天灾不断。黄巾起义爆发，从此开始了近一百年的战乱时代…...'),
(null,'兼爱','images/all_list/ret-search-item_35.jpg',4,'宇文明瑛CY 图：宇文明瑛CY','搞笑','校园','青春','7184','穆要本身是个男孩，刚出生的第二天突然从小弟弟变成一线天。原来，穆要在白天是女孩，晚上12点过才会变回...'),
(null,'断城ZERO','images/all_list/ret-search-item_36.jpg',7,'海带战士','科幻','冒险','治愈','7.3万','飞翔在天际的小快递员萤火虫穿梭于楼宇之间传递邮件。某日在查看一封奇怪信件之际，被不明液体包裹全身，失...');
INSERT INTO xf_user VALUES
(null,"zhangweiqiang","123456","18747984821","images/userphoto/g.gif"),
(null,"zhangdawei","456789","15598359828","images/userphoto/f.jpg");